# IsOrphaned Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IndependentTag..::..IsOrphaned Property
IndependentTag Class See Also
---
Identifies if the tag is orphaned or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsOrphaned { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsOrphaned As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsOrphaned {
	bool get ();
}
```

# Remarks
Orphaned tags are those tags that are associated with one or more linked host that is missing. Tags become orphaned when one or more associated linked host is missing from the link.
# See Also
IndependentTag Class
Autodesk.Revit.DB Namespace